import pandas as pd

data = {
    'Категорія': ['Продукти', 'Продукти', 'Одяг', 'Одяг', 'Електроніка', 'Електроніка'],
    'Сума транзакції': [150, 200, 500, 250, 400, 600],
    'Кількість транзакцій': [1, 1, 1, 1, 1, 1]
}
df = pd.DataFrame(data)

total_sum = df.groupby('Категорія')['Сума транзакції'].sum()
average_value = df.groupby('Категорія')['Сума транзакції'].mean()
max_value = df.groupby('Категорія')['Сума транзакції'].max()

print("-----Загальна сума транзакцій-----")
print(total_sum)
print("-----Середнє зачення-----")
print(average_value)
print("-----Максимальне зачення-----")
print(max_value)